JonS9999/CarClock/CarClock-ESP8266/src/MyWiFi.cpp
//----------------------------------------------------------------------------
//
//  MyWiFi.cpp --
//
//      Version 1.1
//
//----------------------------------------------------------------------------


//
//  System include files :
//
#include <Arduino.h>
#include <ESP8266WiFi.h>    // Wifi for ESP8266.


//
//  Local include files :
//
#include "Common.h"
#include "MyWiFi.h"


//----------------------------------------------------------------------------
//
//  Constructor
//
//----------------------------------------------------------------------------

cMyWiFi::cMyWiFi ( void )
{
  MyPrintf ( "< cMyWiFi constructor called >\n" );


  //
  //  Set our flag to show that we have not yet been initialized :
  //
  m_IsInitialized = false;


  //
  //  Things we want to make sure we do only once :
  //
  //  m_State                               = WIFI_STATE_UNKNOWN;
  m_MyHostname[0]                           = '\0';
  m_MySSID[0]                               = '\0';
  m_HostSSID[0]                             = '\0';
  m_HostConnectionType                      = CON_TYPE_NOT_CONNECTED;
  m_HostEncryptionType                      = ENC_TYPE_NONE;

  m_Callback_Connecting                     = NULL;
  m_Callback_ConnectingAttempt              = NULL;
  m_Callback_NoUsableNetwork                = NULL;
  m_Callback_ScanningForNetworks            = NULL;
  m_Callback_SearchingForOpenNetwork        = NULL;
  m_Callback_SearchingForPreferredNetwork   = NULL;
  m_CallbackOnConnect                       = NULL;
  m_CallbackOnDisconnect                    = NULL;
}


//----------------------------------------------------------------------------
//
//  ConnectTo () --  Routine to scan for WiFi networks and and attempt to
//                   connect to one of them WiFi network :
//
//----------------------------------------------------------------------------

bool cMyWiFi::ConnectTo (   const int       wifiIndex,
                            const char*     SSID,
                            const char*     passwd )
{
    //
    //  Local variables :
    //
    uint8_t     connectionTick      = 0;            // Used when attempting to connect to WiFi.

#define MAX_CONNECT_TIMEOUT         (10000)         // Maximum number of seconds to wait while connecting.
#define MAX_CONNECT_TICKS           (15)            // Maximum number of screen updates to do while waiting.
#define CONNECTION_ATTEMPT_DELAY    (MAX_CONNECT_TIMEOUT / MAX_CONNECT_TICKS)    // How long to wait for each tick.


    MyPrintf ( "[WiFi::ConnectTo]  Called : SSID = [%s] / Network index = %d / Type = %s.\n",
            SSID,
            wifiIndex,
            ( (WiFi.encryptionType(wifiIndex) == ENC_TYPE_NONE) ? "OPEN" : "SECURE" ) );

    //
    //  Call the optional user specified 'connecting' callback :
    //
    if ( m_Callback_Connecting != NULL )
    {
        MyPrintf ( "[WiFi::ConnectTo]  +++ Calling 'connecting' callback +++\n" );
        (*m_Callback_Connecting) ( SSID, passwd );
        MyPrintf ( "[WiFi::ConnectTo]  +++ Back from 'connecting' callback +++\n" );
    }


    MyPrintf ( "[WiFi::ConnectTo]  Waiting a maximum of %u seconds for connection...\n", uint8_t(MAX_CONNECT_TIMEOUT / 1000) );


    //
    //  Now try to connect to the user specified network :
    //
    WiFi.begin ( SSID, passwd );
    //WiFi.begin ( WIFI_PREFERRED[slot].SSID, WIFI_PREFERRED[slot].passwd) ;


    //
    //  Loop a while until we connect or until we timeout :
    //
    connectionTick = 0;

    while ( (WiFi.status() != WL_CONNECTED) && (connectionTick < MAX_CONNECT_TICKS) )
    {
        //
        //  Call the optional user specified 'connecting attempt' callback :
        //
        if ( m_Callback_ConnectingAttempt != NULL )
        {
            //MyPrintf ( "[WiFi::ConnectTo]  +++ Calling 'connecting attempt' callback +++\n" );
            (*m_Callback_ConnectingAttempt) ( connectionTick, MAX_CONNECT_TICKS );
            //MyPrintf ( "[WiFi::ConnectTo]  +++ Back from 'connecting attempt' callback +++\n" );
        }
        else
        {
            Serial.print ( "." );
        }

        delay ( CONNECTION_ATTEMPT_DELAY );

        connectionTick++;

    } // while

    if ( m_Callback_ConnectingAttempt == NULL )
    {
        Serial.printf ( "\n" );
    }


    //
    //  If we have successfully connected to the network, then
    //  do a little house-keeping and return now :
    //
    if ( WiFi.status() == WL_CONNECTED )
    {
        MyPrintf ( "[WiFi::ConnectTo]  Connected!\n" );
        config.isConnected = true;

        strncpy ( m_HostSSID, SSID, sizeof(m_HostSSID) );
        m_HostSSID[sizeof(m_HostSSID)-1] = '\0';

        m_HostEncryptionType = WiFi.encryptionType(wifiIndex);

        displayWifiStatus();

        return ( true );
    }


    MyPrintf ( "[WiFi::ConnectTo]  Connection to [%s] failed.\n", SSID );

    return ( false );
}


//----------------------------------------------------------------------------
//
//  Connect () --  Routine to scan for WiFi networks and and attempt to
//                 connect to one of them WiFi network :
//
//----------------------------------------------------------------------------

bool cMyWiFi::Connect ( void )
{
    //
    //  Local variables :
    //
    char        buf[30];                            // Temporary text buffer.
    bool        firstTime           = true;         // First time we try something?
    bool        status              = false;        // Did we successfully connect to a WiFi network?
    uint8_t     numOpenNetworks     = 0;            // Number of open networks we found.
    uint8_t     numSecureNetworks   = 0;            // Number of secure networks we found.


    //-----------------------------------------------------------------------
    //
    //  Call the optional user specified 'scanning for networks' callback :
    //
    //-----------------------------------------------------------------------

    if ( m_Callback_ScanningForNetworks != NULL )
    {
        MyPrintf ( "[WiFi::Connect]  +++ Calling 'scanning for networks' callback +++\n" );
        (*m_Callback_ScanningForNetworks) ();
        MyPrintf ( "[WiFi::Connect]  +++ Back from 'scanning for networks' callback +++\n" );
    }


    //-----------------------------------------------------------------------
    //
    //  Now get a list of networks we can see :
    //
    //-----------------------------------------------------------------------

    MyPrintf ( "[WiFi::Connect]  Scanning for networks...\n" );
    int n = WiFi.scanNetworks();
    MyPrintf ( "[WiFi::Connect]  Found %d networks.\n", n );


    //
    //  Use this to count the number of secure and open networks :
    //
    MyPrintf ( "[WiFi::Connect]           En                SSID               RSSI  Sec\n" );
    MyPrintf ( "[WiFi::Connect]           -- - ------------------------------  ----  ---\n" );

    for ( int i = 0 ; i < n ; i++ )
    {
        snprintf ( buf, sizeof(buf), "[%s]", WiFi.SSID(i).c_str() );

        MyPrintf ( "[WiFi::Connect]    SSID # %2d : %-30s  %4d   %c\n",
            i,
            buf,
            WiFi.RSSI(i),
            ( (WiFi.encryptionType(i) == ENC_TYPE_NONE) ? ' ' : '*') );

        if ( WiFi.encryptionType(i) == ENC_TYPE_NONE )
        {
            numOpenNetworks++;
        }
        else
        {
            numSecureNetworks++;
        }
    } // for


