JonS9999/CarClock/CarClock-ESP8266/src/MyWiFi.cpp
    if ( n <= 0 )
    {
        MyPrintf ( "[WiFi::Connect]  No networks found.\n" );
        return ( false );
    }

    MyPrintf ( "[WiFi::Connect]  %u secure networks found / %u open networks found.\n",
            numSecureNetworks,
            numOpenNetworks );


    //
    //  Be sure to set "firstTime" to 'true' so we display some initial
    //  messages on the display :
    //
    firstTime = true;


    //
    //  Loop through our list of preferred networks :
    //
    for ( int slot = 0 ; slot < NUM_WIFI_PREFERRED ; slot++ )
    {
        //-----------------------------------------------------------------------
        //
        //  Do some minor sanity checks before we try to connect to a
        //  network :
        //
        //-----------------------------------------------------------------------

        if ( strlen(WIFI_PREFERRED[slot].SSID) == 0 ) continue;


        //-----------------------------------------------------------------------
        //
        //  If this is the first time we're attempting to look for a preferred
        //  network, then call the optional callback :
        //
        //-----------------------------------------------------------------------

        if ( (firstTime == true) && (m_Callback_SearchingForPreferredNetwork != NULL) )
        {
            MyPrintf ( "[WiFi::Connect]  +++ Calling 'searching for a preferred network' callback +++\n" );
            (*m_Callback_SearchingForPreferredNetwork) ();
            MyPrintf ( "[WiFi::Connect]  +++ Back from 'searching for a preferred network' callback +++\n" );

            firstTime =  false;
        }

        MyPrintf ( "[WiFi::Connect]  Looking for SSID [%s]...\n", WIFI_PREFERRED[slot].SSID );

        // Check if our stored SSID is in the scan results
        for ( int i = 0; i < n; i++ )
        {
            if ( WiFi.SSID(i) == String(WIFI_PREFERRED[slot].SSID) )
            {
                //
                //  Only attempt to connect if our preferred network
                //  secure/open setup matches the secure/open setting
                //  of the network we found :
                //
                if ( (strlen(WIFI_PREFERRED[slot].passwd) > 0) &&   // Preferred network is secure (has a password).
                     (WiFi.encryptionType(i) != ENC_TYPE_NONE) )    // Found network is secure (not open).
                {
                    MyPrintf ( "[WiFi::Connect]  Found priority %d: [%s].  Connecting...", (slot + 1), WIFI_PREFERRED[slot].SSID );

                    //
                    //  Try to connect to this network :
                    //
                    status = ConnectTo ( i, WIFI_PREFERRED[slot].SSID, WIFI_PREFERRED[slot].passwd );

                    MyPrintf ( "[WiFi::Connect]  Connection to [%s] %s.\n",
                            WIFI_PREFERRED[slot].SSID,
                            ( (status == true) ? "successful" : "failed" ) );

                    //
                    //  Return now if we were successful :
                    //
                    if ( status == true )
                    {
                        return ( true );
                    }
                }
                else
                {
                    MyPrintf ( "[WiFi::Connect]  Skipping [%s] : Preferred is %s / Found is %s.\n",
                        WIFI_PREFERRED[slot].SSID,
                        ( (strlen(WIFI_PREFERRED[slot].passwd) > 0) ? "SECURE" : "OPEN" ),
                        ( (WiFi.encryptionType(i) != ENC_TYPE_NONE) ? "SECURE" : "OPEN" ) );
                }
            } // if
        } // for
    } // for


    //-----------------------------------------------------------------------
    //
    //  If we reach this point, then that means we've struck out on finding
    //  any of our preferred networks.  Therefore, we look for open networks
    //  in hopes of finding one that is connected to the Internet.
    //
    //-----------------------------------------------------------------------

    //
    //  Be sure to set "firstTime" to 'true' so we display some initial
    //  messages on the display :
    //
    firstTime = true;


    //
    //  Walk through the list of networks we found, and try to find
    //  one that is an open network :
    //
    for ( int i = 0 ; i < n ; i++ )
    {
        //
        //  Is this an open network ?
        //
        if ( WiFi.encryptionType(i) == ENC_TYPE_NONE )
        {
            if ( (firstTime == true) && (m_Callback_SearchingForOpenNetwork != NULL) )
            {
                MyPrintf ( "[WiFi::Connect]  +++ Calling 'searching for an open network' callback +++\n" );
                (*m_Callback_SearchingForOpenNetwork) ();
                MyPrintf ( "[WiFi::Connect]  +++ Back from 'searching for an open network' callback +++\n" );

                firstTime =  false;
            }

            //
            //  Try to connect to this open network :
            //
            status = ConnectTo ( i, WiFi.SSID(i).c_str() );

            MyPrintf ( "[WiFi::Connect]  Connection to [%s] %s.\n",
                    WiFi.SSID(i).c_str(),
                    ( (status == true) ? "successful" : "failed" ) );

            //
            //  Return now if we were successful :
            //
            if ( status == true )
            {
                return ( true );
            }


#if 0   // OLD CODE
            //
            //  Call the optional user specified 'connecting' callback :
            //
            if ( m_Callback_Connecting != NULL )
            {
                MyPrintf ( "[WiFi::Connect]  +++ Calling 'connecting' callback +++\n" );
                (*m_Callback_Connecting) ( WiFi.SSID(i).c_str(), NULL );
                MyPrintf ( "[WiFi::Connect]  +++ Back from 'connecting' callback +++\n" );

                WiFi.begin ( WiFi.SSID(i).c_str() );

                // Wait up to 10s for connection
                unsigned long start = millis();
                while ( (WiFi.status() != WL_CONNECTED) && ((millis() - start) < 10000)) {
                    delay(500);
                    Serial.print(".");
                }
                Serial.printf ( "\n" );

                //
                //  If we have successfully connected to the network, then
                //  do a little house-keeping and return now :
                //
                if ( WiFi.status() == WL_CONNECTED )
                {
                    MyPrintf ( "[WiFi::Connect]  Connected!\n" );
                    config.isConnected = true;

                    strncpy ( m_HostSSID, WiFi.SSID(i).c_str(), sizeof(m_HostSSID) );
                    m_HostSSID[sizeof(m_HostSSID)-1] = '\0';

