JonS9999/CarClock/CarClock-ESP8266/src/MyWiFi.cpp
                    m_HostEncryptionType = WiFi.encryptionType(i);

                    displayWifiStatus();

                    return ( true );
                }

                MyPrintf ( "[WiFi::Connect]  Connection failed.\n" );
            }

#endif  // OLD CODE

        } // if
    } // for


    //-----------------------------------------------------------------------
    //
    //  Finally, if we're reached this point, then we've exhausted all of
    //  our options, so we just bail :
    //
    //-----------------------------------------------------------------------

    config.isConnected = false;

    if ( m_Callback_NoUsableNetwork != NULL )
    {
        MyPrintf ( "[WiFi::Connect]  +++ Calling 'no usable network found' callback +++\n" );
        (*m_Callback_NoUsableNetwork) ( numSecureNetworks, numOpenNetworks );
        MyPrintf ( "[WiFi::Connect]  +++ Back from 'no usable network found' callback +++\n" );
    }

    //
    //  Clear out the information about who we were connected to :
    //
    m_HostSSID[0]           = '\0';
    m_HostEncryptionType    = ENC_TYPE_NONE;

    return ( false );
}


//----------------------------------------------------------------------------
//
//  Return the connection type of the host we're connected to :
//
//----------------------------------------------------------------------------
const tWiFiConnectionType cMyWiFi::GetHostConnectionType ( void )
{
    //
    //  If we are not connected, return now :
    //
    if ( WiFi.status() != WL_CONNECTED )
    {
        return ( CON_TYPE_NOT_CONNECTED );
    }


    //
    //  We are connected to a host, so return our connection type :
    //
    switch ( GetHostEncryptionType() )
    {
        //
        //  Open (insecure) network :
        //
        case ENC_TYPE_NONE :            // Open (Insecure).
            return ( CON_TYPE_OPEN );
            break;

        //
        //  Secure network :
        //
        case ENC_TYPE_WEP   :           // ENC_TYPE_WEP.
        case ENC_TYPE_TKIP  :           // ENC_TYPE_TKIP.
        case ENC_TYPE_CCMP  :           // AUTH_WPA2_PSK.
        case ENC_TYPE_AUTO  :           // AUTH_WPA_WPA2_PSK.
            return ( CON_TYPE_SECURE );
            break;

        //
        //  Unknown encryption type !!!
        //
        default :
            break;
    } // switch


    //
    //  Unknown encryption/connection type !!!
    //
    return ( CON_TYPE_UNKNOWN );
}


//----------------------------------------------------------------------------
//
//   GetMacAddr () -- Return our MAC address in the form AABBCCDDEEFF.
//
//----------------------------------------------------------------------------

char* cMyWiFi::GetMacAddr ( void )
{
  //
  //  Local variables :
  //
  static bool   firstTime       = true;
  static char   myMacAddr[MAC_ADDR_SIZE];


  //
  //  If this is the first time we're being called, then we need to fetch
  //  the MAC address and format it.  From then on, we'll just return the
  //  formatted MAC address (since it will never change during runtime) :
  //
  if ( firstTime == true )
  {
    char  tempBuf[MAC_ADDR_SIZE + 6];
    char* srcPtr;
    char* dstPtr;

    WiFi.macAddress().toCharArray ( tempBuf, sizeof(tempBuf) );
    tempBuf[sizeof(tempBuf) - 1] = '\0';
    srcPtr = tempBuf;
    dstPtr = myMacAddr;

    *dstPtr = '\0';

    while ( (*srcPtr != '\0') && (strlen(myMacAddr) < (sizeof(myMacAddr) - 1)) )
    {
      //
      //  Only copy hexadecimal digits (0-9A-F) :
      //
      if ( (isdigit((int)*srcPtr) == true) || ( (*srcPtr >= 'A') && (*srcPtr <= 'F') ) )
      {
        *dstPtr = *srcPtr;
        dstPtr++;
        *dstPtr = '\0';
      }
      srcPtr++;

    } // while

    firstTime = false;

  } // if


  //
  //  Simply return a pointer to the formatted MAC address :
  //
  return ( myMacAddr );
}


//----------------------------------------------------------------------------
//
//   GetMacAddrHigh () -- Return the high half of our MAC address.
//
//      Example :
//
//          Our MAC = AA:BB:CC:DD:EE:FF
//
//          We return AABBCC.
//
//----------------------------------------------------------------------------

char* cMyWiFi::GetMacAddrHigh ( void )
{
  //
  //  Local variables :
  //
  static bool   firstTime       = true;
  static char   myMacAddrHigh[8];


  //
  //  If this is the first time we're being called, then we need to fetch
  //  the MAC address and format it.  From then on, we'll just return the
  //  formatted MAC address (since it will never change during runtime) :
  //
  if ( firstTime == true )
  {
    //
    //  Get the whole MAC adderss :
    //
    strncpy ( myMacAddrHigh, GetMacAddr(), sizeof(myMacAddrHigh) );
    myMacAddrHigh[sizeof(myMacAddrHigh) - 1] = '\0';

    //
    //  Now cut the string so we only use the first 6 characters :
    //
    myMacAddrHigh[6] = '\0';// "aabbcc".

    firstTime = false;
  } // if


  //
  //  Simply return a pointer to the formatted high portion of our MAC address :
  //
  return ( myMacAddrHigh );
}


//----------------------------------------------------------------------------
//
//   GetMacAddrLow () -- Return the low half of our MAC address.
//
//      Example :
//
//          Our MAC = AA:BB:CC:DD:EE:FF
//
//          We return DDEEFF.
//
//----------------------------------------------------------------------------

char* cMyWiFi::GetMacAddrLow ( void )
{
  //
  //  Local variables :
  //
  static bool   firstTime       = true;
  static char   myMacAddrLow[8];


  //
  //  If this is the first time we're being called, then we need to fetch
  //  the MAC address and format it.  From then on, we'll just return the
  //  formatted MAC address (since it will never change during runtime) :
  //
  if ( firstTime == true )
  {
    char  myMacAddr[MAC_ADDR_SIZE];

    //
    //  Get the whole MAC adderss :
    //
    strncpy ( myMacAddr, GetMacAddr(), sizeof(myMacAddr) );
    myMacAddr[sizeof(myMacAddr) - 1] = '\0';

    //
    //  Now copy only the last 6 characters of the MAC address :
    //
    strncpy ( myMacAddrLow, &myMacAddr[6], sizeof(myMacAddrLow) );
    myMacAddrLow[sizeof(myMacAddrLow) - 1] = '\0';

    firstTime = false;
  } // if


  //
  //  Simply return a pointer to the formatted low portion of our MAC address :
  //
  return ( myMacAddrLow );
}


//----------------------------------------------------------------------------
//
//  MyHostname () -- Routine to return the name of this app (including the
//                   last four characters of our MAC address).
//
//----------------------------------------------------------------------------

