JonS9999/CarClock/CarClock-ESP8266/src/MyWiFi.cpp
const char* cMyWiFi::MyHostname ( void )
{
    //
    //  Local variables :
    //
    static char     s_MyHostname[60];           // My name + low four MAC address characters.


    //
    //  Generate our hostname based on the last few digits of our MAC :
    //
    snprintf ( s_MyHostname, sizeof(s_MyHostname), "%s-%s",
                PROJECT_NAME,                                           // Common.h
                cMyWiFi::GetMacAddrLow() );                             // WiFi.cpp


    //
    //  Return a pointer to our name :
    //
    return ( s_MyHostname );
}


//-----------------------------------------------------------------------------
//
//  Routine to set the 'connecting' callback :
//
//-----------------------------------------------------------------------------

void  cMyWiFi::SetCallback_Connecting ( void (*ptr) (   const char* SSID,
                                                        const char* passwd ) )
{
  MyPrintf ( "[WiFi::SetCallback_Connecting] : Called : Callback = 0x%08X.\n", ( (ptr != NULL) ? ptr : 0x0000 ) );

  m_Callback_Connecting = ptr;
}


//-----------------------------------------------------------------------------
//
//  Routine to set the 'connecting attempt' callback :
//
//-----------------------------------------------------------------------------

void  cMyWiFi::SetCallback_ConnectingAttempt ( void (*ptr) (    const uint8_t   numAttemptsSoFar,
                                                                const uint8_t   maxAttempts ) )
{
  MyPrintf ( "[WiFi::SetCallback_ConnectingAttempt] : Called : Callback = 0x%08X.\n", ( (ptr != NULL) ? ptr : 0x0000 ) );

  m_Callback_ConnectingAttempt = ptr;
}


//-----------------------------------------------------------------------------
//
//  Routine to set the 'no usable network found' callback :
//
//-----------------------------------------------------------------------------

void  cMyWiFi::SetCallback_NoUsableNetwork ( void (*ptr) (  const uint8_t numSecureNetworks,
                                                            const uint8_t numOpenNetworks ) )
{
  MyPrintf ( "[WiFi::SetCallback_NoUsableNetwork] : Called : Callback = 0x%08X.\n", ( (ptr != NULL) ? ptr : 0x0000 ) );

  m_Callback_NoUsableNetwork = ptr;
}


//-----------------------------------------------------------------------------
//
//  Routine to set the 'scanning for networks' callback :
//
//-----------------------------------------------------------------------------

void  cMyWiFi::SetCallback_ScanningForNetworks ( void (*ptr) ( void ) )
{
  MyPrintf ( "[WiFi::SetCallback_ScanningForNetworks] : Called : Callback = 0x%08X.\n", ( (ptr != NULL) ? ptr : 0x0000 ) );

  m_Callback_ScanningForNetworks = ptr;
}


//-----------------------------------------------------------------------------
//
//  Routine to set the 'searching for an open network' callback :
//
//-----------------------------------------------------------------------------

void  cMyWiFi::SetCallback_SearchingForOpenNetwork ( void (*ptr) ( void ) )
{
  MyPrintf ( "[WiFi::SetCallback_SearchingForOpenNetwork] : Called : Callback = 0x%08X.\n", ( (ptr != NULL) ? ptr : 0x0000 ) );

  m_Callback_SearchingForOpenNetwork = ptr;
}


//-----------------------------------------------------------------------------
//
//  Routine to set the 'searching for a preferred network' callback :
//
//-----------------------------------------------------------------------------

void  cMyWiFi::SetCallback_SearchingForPreferredNetwork ( void (*ptr) ( void ) )
{
  MyPrintf ( "[WiFi::SetCallback_SearchingForPreferredNetwork] : Called : Callback = 0x%08X.\n", ( (ptr != NULL) ? ptr : 0x0000 ) );

  m_Callback_SearchingForPreferredNetwork = ptr;
}


//-----------------------------------------------------------------------------
//
//  Routine to set the 'on connect' callback :
//
//-----------------------------------------------------------------------------

void  cMyWiFi::SetCallbackOnConnect ( void (*ptr) ( void ) )
{
  MyPrintf ( "[WiFi::SetCallbackOnConnect] : Called : Callback = 0x%08X.\n", ( (ptr != NULL) ? ptr : 0x0000 ) );

  m_CallbackOnConnect = ptr;
}


//-----------------------------------------------------------------------------
//
//  Routine to set the 'on disconnect' callback :
//
//-----------------------------------------------------------------------------

void  cMyWiFi::SetCallbackOnDisconnect ( void (*ptr) ( void ) )
{
  MyPrintf ( "[WiFi::SetCallbackOnDisconnect] : Called : Callback = 0x%08X.\n", ( (ptr != NULL) ? ptr : 0x0000 ) );

  m_CallbackOnDisconnect = ptr;
}


//----------------------------------------------------------------------------
//
//  setup () -- Routine to setup all things WiFi related.
//
//----------------------------------------------------------------------------

void cMyWiFi::setup ( void )
{
    MyPrintf ( "[WiFi::setup]  Called.\n" );


    //
    //  Initialize our OTA object :
    //
    m_WiFi_OTA.setup ( MyHostname() );
}


//----------------------------------------------------------------------------
//
//  handle () -- Routine to check for WiFi changes.
//
//----------------------------------------------------------------------------

void cMyWiFi::handle ( void )
{
  //
  //  Local variables :
  //
#if 0   // OLD CODE
  bool              nowIsConnected      = IsConnected();                    // Are we currently connected?
  time_t            curMSecs            = millis();                         // Current time in milli-seconds.
  time_t            curDeciSecs         = MSECS_TO_DECI_SECS ( curMSecs );  // Current time in deci-seconds.
  time_t            curSecs             = MSECS_TO_SECS ( curMSecs );       // Current time in seconds.
  static  bool      oldIsConnected      = false;                            // Were we connect the last time we were called?
  static  time_t    oldDeciSecs         = 0;                                // Number of deci-seconds the last time we were called.
  static  time_t    oldSecs             = 0;                                // Number of seconds the last time we were called.
  static  uint32_t  debounceDeciSecs    = 0;                                // Used to "debounce" detecting WiFi connection.  1 deci-second = 0.1 seconds.
  const   uint32_t  DEBOUNCE_DECI_SECS  = 30;                               // Number of deci-seconds (0.1 seconds) for debouncing.
#endif


  //--------------------------------------------------------------------
  //
  //  Is this the first time we're being called ?
  //
  //--------------------------------------------------------------------

