JonS9999/CarClock/CarClock-ESP8266/src/MyWiFi.cpp
  if ( g_FirstTime == true )
  {
    MyPrintf ( F("[WiFi::handle]  Called.\n") );
  }


    //
    //  Call our OTA handler :
    //
    m_WiFi_OTA.handle ();
}


//----------------------------------------------------------------------------

//----------------------------------------------------------------------------

void displayStoredSSIDs(void) {

    MyPrintf ( "--- Stored WiFi Priorities ---\n" );

    for (int i = 0; (i < NUM_WIFI_PREFERRED); ++i) {
        MyPrintf ( "Slot %d: ", (i + 1) );
        if ( (strlen(WIFI_PREFERRED[i].SSID) > 0) ) {
            Serial.printf("SSID: [%s]\n", WIFI_PREFERRED[i].SSID);
        } else {
            Serial.println("<EMPTY>");
        }
    }
    MyPrintf ( "------------------------------\n") ;
}

//----------------------------------------------------------------------------

void displayVisibleNetworks ( void )
{
    //
    //  Local variables :
    //
    char buf[30];                   // Temporary text buffer.


    MyPrintf ( "[displayVisibleNetworks]  Starting scan...\n" );

    // WiFi.scanNetworks returns the number of networks found
    int n = WiFi.scanNetworks();

    MyPrintf ( "[displayVisibleNetworks]  Scan complete.\n" );

    MyPrintf ( "[displayVisibleNetworks]  %d networks found.\n", n );

    for (int i = 0; i < n; ++i)
    {
        // Print SSID and RSSI for each network found
        // RSSI: -30 to -60 is excellent, -90 is very poor.
        snprintf ( buf, sizeof(buf), "[%s]", WiFi.SSID(i).c_str() );

        MyPrintf ( "[displayVisibleNetworks]     %2d : %-15s  (%d dBm) %s\n",
            ( i + 1 ),
            buf,
            WiFi.RSSI(i),
            (WiFi.encryptionType(i) == ENC_TYPE_NONE) ? " " : "*");

        delay(10);
    }

    // Clean up scan results from memory
    WiFi.scanDelete();
}

//----------------------------------------------------------------------------

void displayWifiStatus(void)
{
    if ( (WiFi.status() == WL_CONNECTED) )
    {
        MyPrintf ( "--- Current Network Status ---\n" );
        MyPrintf ( "SSID:       %s\n", WiFi.SSID().c_str() );
        MyPrintf ( "IP Address: %s\n", WiFi.localIP().toString().c_str()) ;
        MyPrintf ( "Subnet:     %s\n", WiFi.subnetMask().toString().c_str() );
        MyPrintf ( "Gateway:    %s\n", WiFi.gatewayIP().toString().c_str() );
        MyPrintf ( "RSSI:       %d dBm\n", WiFi.RSSI()) ;
        MyPrintf ( "------------------------------\n" );
    }
    else
    {
        MyPrintf ( "[displayWifiStatus]  WiFi not connected.\n" );
    }
}


//----------------------------------------------------------------------------
//
//  end of  MyWifi.cpp
//
//----------------------------------------------------------------------------
